app/Controllers/auth.php

    public function dashboard()
    {
        $session = session();

        // ✅ Step 1: Authorization check
        if (!$session->get('isLoggedIn')) {
            $session->setFlashdata('login_error', 'Please login first.');
            return redirect()->to('login');
        }

        $model = new UserModel();
        $userRole = $session->get('user_role');  // ✅ Changed from 'role' to 'user_role'
        $userId = $session->get('user_id');

        $roleData = [];

        // ✅ Step 2: Fetch role-specific data
        if ($userRole === 'admin') {
            $roleData['total_users'] = $model->countAll();
            $roleData['recent_users'] = $model->orderBy('id', 'DESC')->findAll(5);
        } elseif ($userRole === 'teacher') {
            $roleData['students'] = $model->where('role', 'student')->findAll();
        } elseif ($userRole === 'student') {
            $roleData['profile'] = $model->find($userId);

            // Fetch enrolled and available courses
            $enrollmentModel = new \App\Models\EnrollmentModel();
            $db = \Config\Database::connect();

            $enrolledCourses = $enrollmentModel->getUserEnrollments($userId);
            $allCourses = $db->table('courses')->get()->getResultArray();
---
SELECT *
FROM `courses`