app/Controllers/auth.php

    public function register()
    {
        helper(['form']);
        $session = session();
        $model   = new UserModel();

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'name'             => 'required|min_length[3]|max_length[100]',
                'email'            => 'required|valid_email|is_unique[users.email]',
                'password'         => 'required|min_length[6]',
                'password_confirm' => 'matches[password]',
                'role'             => 'required|in_list[admin,teacher,student]'
            ];

            if ($this->validate($rules)) {
                try {
                    $data = [
                        'name'     => trim($this->request->getPost('name')),
                        'email'    => $this->request->getPost('email'),
                        'password' => $this->request->getPost('password'),
                        'role'     => $this->request->getPost('role')
                    ];

                    if ($model->insert($data)) {
---
INSERT INTO `users` (`name`, `email`, `password`, `role`, `created_at`, `updated_at`) VALUES ('vester', 'admin@gmail.com', '$2y$10$T1u5HavltcLzDw43gcEtTuH2PTHF1NsweQqSpN0qPnNPeFSONKINO', 'teacher', '2025-09-19 13:31:32', '2025-09-19 13:31:32')

    public function login()
    {
        helper(['form']);
        $session = session();

        if ($this->request->getMethod() === 'POST') {
            $rules = [
                'email'    => 'required|valid_email',
                'password' => 'required'
            ];

            if ($this->validate($rules)) {
                $email    = $this->request->getPost('email');
                $password = trim($this->request->getPost('password'));

                try {
                    $model = new UserModel();
                    $user  = $model->where('email', $email)->first();
---
SELECT *
FROM `users`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1

    public function profile()
    {
        helper(['form']);
        $session = session();

        // Check if user is logged in
        if (!$session->get('isLoggedIn')) {
            return redirect()->to('/login')->with('error', 'Please login first.');
        }

        $userId = $session->get('user_id');
        $userModel = new UserModel();
        $user = $userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'

    public function dashboard()
    {
        $session = session();

        // ✅ Step 1: Authorization check
        if (!$session->get('isLoggedIn')) {
            $session->setFlashdata('login_error', 'Please login first.');
            return redirect()->to('login');
        }

        $model = new UserModel();
        $role  = $session->get('role');
        $userId = $session->get('user_id');

        $roleData = [];

        // ✅ Step 2: Fetch role-specific data
        if ($role === 'admin') {
            $roleData['total_users'] = $model->countAll();
            $roleData['total_students'] = $model->where('role', 'student')->where('status', 'active')->countAllResults();
            $roleData['total_teachers'] = $model->where('role', 'teacher')->where('status', 'active')->countAllResults();
            $roleData['total_admins'] = $model->where('role', 'admin')->where('status', 'active')->countAllResults();
            $roleData['recent_users'] = $model->orderBy('id', 'DESC')->findAll(5);
        } elseif ($role === 'teacher') {
            $roleData['students'] = $model->where('role', 'student')->findAll();
        } elseif ($role === 'student') {
            $roleData['profile'] = $model->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '5'

            $db = \Config\Database::connect();

            $enrolledCourses = $enrollmentModel->getUserEnrollments($userId);
            $allCourses = $db->table('courses')->get()->getResultArray();
---
SELECT *
FROM `courses`