app/Controllers/Course.php

    public function search()
    {
        $request = service('request');
        $term = $request->getVar('term');

        $db = \Config\Database::connect();
        $builder = $db->table('courses');

        if (!empty($term)) {
            $builder->groupStart()
                    ->like('title', $term)
                    ->orLike('description', $term)
                    ->groupEnd();
        }

        $query = $builder->get();
---
SELECT *
FROM `courses`
WHERE   (
`title` LIKE '%phy%' ESCAPE '!'
OR  `description` LIKE '%phy%' ESCAPE '!'
 )

    public function manage()
    {
        $session = session();

        // Check if user is logged in and has permission (admin or teacher)
        if (!$session->get('isLoggedIn') || !in_array($session->get('role'), ['admin', 'teacher'])) {
            $session->setFlashdata('error', 'Access denied. Only admins and teachers can manage course materials.');
            return redirect()->to('/dashboard');
        }

        // Get courses assigned to the teacher or all for admin
        $db = \Config\Database::connect();
        if ($session->get('role') === 'teacher') {
            $courses = $db->table('courses')->where('teacher_id', $session->get('user_id'))->get()->getResultArray();
        } else {
            $courses = $db->table('courses')->get()->getResultArray();
        }

        $data = [
            'courses' => $courses,
            'user_name' => $session->get('user_name'),
            'role' => $session->get('role')
        ];
---
SELECT *
FROM `courses`
SELECT *
FROM `courses`
WHERE `id` = '1'