app/Controllers/Materials.php

SELECT *
FROM `courses`
WHERE `id` = '1'
---
    public function upload($course_id)
    {
        $session = session();
        $userRole = $session->get('role');

        // Check if user is logged in and has permission (admin or teacher)
        if (!$session->get('isLoggedIn') || !in_array($userRole, ['admin', 'teacher'])) {
            $session->setFlashdata('error', 'Access denied. Only admins and teachers can upload materials.');
            return redirect()->to('/dashboard');
        }

        // Check if course exists
        $db = \Config\Database::connect();
        $course = $db->table('courses')->where('id', $course_id)->get()->getRow();