app/Models/EnrollmentModel.php

SELECT `enrollments`.*, `courses`.`title` as `course_name`, `courses`.`description`, `courses`.`course_code`, `courses`.`schedule_days`, `courses`.`schedule_time_start`, `courses`.`schedule_time_end`, `courses`.`school_year`, `courses`.`semester`
FROM `enrollments`
JOIN `courses` ON `courses`.`id` = `enrollments`.`course_id`
WHERE `enrollments`.`user_id` = '1'
ORDER BY `enrollments`.`enrolled_at` DESC
---
    public function getUserEnrollments($user_id)
    {
        $builder = $this->db->table($this->table);
        $builder->select('enrollments.*, courses.title as course_name, courses.description, courses.course_code, courses.schedule_days, courses.schedule_time_start, courses.schedule_time_end, courses.school_year, courses.semester'); // Adjust fields as per your courses table
        $builder->join('courses', 'courses.id = enrollments.course_id');
        $builder->where('enrollments.user_id', $user_id);
        $builder->orderBy('enrollments.enrolled_at', 'DESC');

        return $builder->get()->getResultArray();