app/Models/MaterialModel.php

INSERT INTO `materials` (`course_id`, `file_name`, `file_path`, `created_at`) VALUES ('1', 'Laboratory Exercise 6 COURSE ENROLLMENT SYSTEM (1).docx', 'E:\\xampp\\htdocs\\ITE311-ALBARINA\\writable\\uploads/1761059098_eb646c0bb628d016ed62.docx', '2025-10-21 15:04:58')
---
    public function insertMaterial($data)
    {
        // Set created_at to now if not provided
        if (!isset($data['created_at'])) {
            $data['created_at'] = date('Y-m-d H:i:s');
        }

        return $this->insert($data);

SELECT COUNT(*) AS `numrows`
FROM `materials`
WHERE `course_id` = '1'
---
    public function getMaterialsCountByCourse($courseId)
    {
        return $this->where('course_id', $courseId)->countAllResults();

SELECT *
FROM `materials`
WHERE `course_id` = '1'
ORDER BY `created_at` DESC
---
    public function getMaterialsByCourse($courseId)
    {
        return $this->where('course_id', $courseId)
                    ->orderBy('created_at', 'DESC')
                    ->findAll();