app/Models/MaterialModel.php

    public function getMaterialsByCourse($course_id)
    {
        return $this->where('course_id', $course_id)->findAll();
---
SELECT *
FROM `materials`
WHERE `course_id` = '3'