app/Models/NotificationModel.php

    public function getUnreadCount($userId)
    {
        return $this->where('user_id', $userId)
                    ->where('is_read', 0)
                    ->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `notifications`
WHERE `user_id` = '1'
AND `is_read` = 0

    public function getNotificationsForUser($userId)
    {
        return $this->where('user_id', $userId)
                    ->orderBy('created_at', 'DESC')
                    ->limit(5)
                    ->findAll();
---
SELECT *
FROM `notifications`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 5